# 3. Написать функцию, аргументы имена сотрудников, 
# возвращает словарь, ключи — первые буквы имён, 
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def thesaurus(*names)name_list = "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
print(name_list)

dictionary = {}

for name in name_list:
    key = name[0]

    if key not in dictionary:
        dictionary[key] = []
    dictionary[key].append(name)

print (dictionary)
